tests/performance/load-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Load test"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./test-processor.js"
  payload:
    path: "test-data.csv"
    fields:
      - "email"
      - "password"
      - "productName"
      - "price"
  variables:
    productCount: 20
    categoryCount: 5
  http:
    timeout: 10
    pool: 50
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  - name: "User Registration and Login"
    weight: 30
    flow:
      - post:
          url: "/api/auth/register"
          headers:
            Content-Type: "application/json"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            name: "Performance Test User"
          capture:
            - json: "$.user._id"
              as: "userId"
          expect:
            - statusCode: 201
            - contentType: "application/json"
            - hasProperty: "user"
      
      - think: 2
      
      - post:
          url: "/api/auth/login"
          headers:
            Content-Type: "application/json"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
            - hasProperty: "token"

  - name: "Browse Products"
    weight: 40
    flow:
      - get:
          url: "/api/products"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      
      - think: 1
      
      - loop:
          - get:
              url: "/api/products/{{ $randomInt(1, 20) }}"
              expect:
                - statusCode: 200
                - hasProperty: "product"
          count: 5
      
      - think: 1

  - name: "Product Search and Filter"
    weight: 20
    flow:
      - get:
          url: "/api/products?search=laptop"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      
      - think: 1
      
      - get:
          url: "/api/products?category=electronics"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      
      - think: 1
      
      - get:
          url: "/api/products?minPrice=100&maxPrice=1000"
          expect:
            - statusCode: 200
            - contentType: "application/json"

  - name: "Categories and Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"
      
      - think: 1
      
      - get:
          url: "/api/categories"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      
      - think: 1
      
      - loop:
          - get:
              url: "/api/categories/{{ $randomInt(1, 5) }}"
              expect:
                - statusCode: 200
          count: 3